Repository: PHOENIXCONTACT/MORYX-AbstractionLayer
Catalog: src/Marvin.Resources.UI.Interaction/Properties/Strings.*.resx
Languages: de

# ModuleController_DisplayName
source: Resources
de: Resourcen

# InteractionWorkspaceView_Resources
source: Resources
de: Resourcen

# InteractionWorkspaceView_Add
source: Add
de: Hinzufügen

# InteractionWorkspaceView_Remove
source: Remove
de: Entfernen

# InteractionWorkspaceView_Cancel
source: Cancel
de: Abbrechen

# InteractionWorkspaceView_Edit
source: Edit
de: Editieren

# InteractionWorkspaceView_Save
source: Save
de: Speichern

# TypeSelectorViewModel_DisplayName
source: Resource type selection:
de: Resourcentypauswahl:

# TypeSelectorView_SelectResourceType
source: Please select the resource type to create a resource instance.
de: Bitte einen Resourcentyp zum Anlegen auswählen.

# TypeSelectorView_Cancel
source: Cancel
de: Abbrechen

# TypeSelectorView_Create
source: Create
de: Anlegen

# TypeSelectorView_Internal
source: Internal:
de: Intern:

# TypeSelectorView_Description
source: Description:
de: Beschreibung:

# ResourceMethodsAspectView_Invoke
source: Invoke
de: Aufrufen

# ResourceMethodsAspectView_Result
source: Result
de: Ergebnis

# ReferencesAspectView_Type
source: Type
de: Typ

# InteractionWorkspaceView_Description
source: Description:
de: Beschreibung:

# ReferencesAspectView_Reference
source: Reference:
de: Referenz:

# ReferencesAspectView_Description
source: Description:
de: Beschreibung:

# ReferencesAspectView_LinkTarget
source: Link Target
de: Ziel setzen

# ReferencesAspectView_UnlinkTarget
source: Unlink Target
de: Ziel entfernen

# PropertiesAspectViewModel_DisplayName
source: Properties
de: Eigenschaften

# ReferencesAspectViewModel_DisplayName
source: References
de: Referenzen

# ResourceMethodsAspectViewModel_DisplayName
source: Methods
de: Funktionen

# ResourceMethodsAspectView_SelectMethod
source: Please select a method to invoke it
de: Wählen Sie eine Funktion aus, um diese auszuführen

# ResourceMethodsAspectView_NoParametersNeeded
source: There are no parameters necessary for this method call
de: Es sind keine Parameter für die Ausführung notwendig

# ResourceMethodsAspectView_Invoked
source: Method was invoked
de: Funktion wurde ausgeführt

# ResourceMethodsAspectView_Method
source: Method:
de: Funktion:

# ResourceMethodsAspectView_Description
source: Description:
de: Beschreibung:

# RemoveResourceViewModel_ErrorWhileRemove
source: The resource was not removed!
de: Die Resource wurde nicht entfernt!

# RemoveResourceView_Description
source: The following resource will be irreversible removed:
de: Die folgende Resource wird unwiderruflich gelöscht:

# RemoveResourceView_Remove
source: Remove
de: Entfernen

# RemoveResourceView_Cancel
source: Cancel
de: Abbrechen

# RemoveResourceViewModel_DisplayName
source: Remove Resource
de: Resource entfernen

# ReferencesAspectView_AddTarget
source: Add Target
de: Ziel hinzufügen

# ReferencesAspectView_RequiredReference
source: This reference is required and must be set!
de: Diese Referenz wird benötigt und muss gesetzt werden!

# ReferencesAspectViewModel_Validation_CollectionTargetMustBeSet
source: The reference must have at least one target!
de: Diese Liste aus Referenzen benötigt mindestens ein Ziel!

# ReferencesAspectViewModel_Validation_SingleTargetMustBeSet
source: Single references must have any target!
de: Diese Referenz benötigt ein Ziel!

# SelectTargetDialogViewModel_DisplayName
source: Select new target
de: Ziel auswählen

# ReferencesAspectView_SingleReference_TargetNull
source: This reference currently has not target.
de: Diese Referenz hat momentan kein Ziel.
